#include <stdio.h>

int main() {
    
    //Припустимо що це наша матриця, на якій розставлені фігури, які завжди мають форму в вигляді букви Г
    int a[10][11] ={{0,0,1,0,0,1,0,0,0,0},
                    {1,0,1,0,0,1,0,0,0,0},
                    {1,0,1,1,0,1,1,1,0,0},
                    {1,0,0,0,0,0,0,0,0,0},
                    {1,1,1,0,0,1,1,1,1,0},
                    {0,0,0,0,0,0,0,0,1,0},
                    {0,0,0,0,0,0,0,0,0,0},
                    {0,0,0,1,1,1,0,0,0,1},
                    {0,0,0,1,0,0,0,0,1,1}};
    
    /*Проганяємо масив вздовж і поперек
     до 8 і до 9 щоб не вилізти за межі масиву
     порівнюємо значення в масиві з масками [11] [11] [01] [10]
                                            [01] [10] [11] [11]
     тобто шукаємо в масиві кут. Якщо збігається, значить ми найшли фігуру буквою Г
     і збільшуємо лічильник*/
    int count =0;
    for (int i=0; i<8; i++){
        for (int j=0; j<9; j++){
            //замість прямого порівняння елементів масивів із 0 чи 1, можна зробити масив маску
            //з фігурою, яку потрібно знайти і вже порівнювати елементи основного масиву
            //із елементами масиву з маскою. Я вважаю що такі дії доцільніші із використанням більш складних
            //фігур.
            //декілька операторів if можна замінити на один із використанням || (логічного або)
             if (a[i][j] == 1 && a[i][j+1] == 1 && a[i+1][j] == 0 && a[i+1][j+1] == 1) count++;
             if (a[i][j] == 1 && a[i][j+1] == 1 && a[i+1][j] == 1 && a[i+1][j+1] == 0) count++;
             if (a[i][j] == 0 && a[i][j+1] == 1 && a[i+1][j] == 1 && a[i+1][j+1] == 1) count++;
             if (a[i][j] == 1 && a[i][j+1] == 0 && a[i+1][j] == 1 && a[i+1][j+1] == 1) count++;
        }
    }
    printf("Число фігур буквою Г = %d\n", count);
    
    return 0;
}
